{
    "hero_title": "Welcome to my portfolio",
    "hero_sub": "Full-Stack Developer & Fashion Designer. UI/UX, performance, and accessibility.",
    "about_title": "About me",
    "about_intro": "Hello! Nice to see you",
    "about_text": "My name is Erika. I studied fashion design, which gave me strong skills in creativity, project management, and attention to detail. Recently, I decided to transition into tech, and now I’m a Java Full-Stack Developer.",
    "skills_title": "Some of my skills:",
    "skills_list": "HTML, CSS, Bootstrap, JavaScript, Java, Spring Boot, React, Tailwind, Adobe Suite, SQL, Git/GitHub...",
    "about_linkedin_intro": "If you want to know more about my professional environment, here’s my LinkedIn profile.",
    "about_linkedin_btn": "LinkedIn",
    "problem_solving_btn": "Problem Solving",
    "user_stories_btn": "User Stories",
    "team_roles_btn": "Team Roles",
    "modal_problem_title": "Challenges & Solutions",
    "modal_problem_1": "Configuring AWS Elastic Beanstalk was challenging due to environment variable errors.",
    "modal_problem_2": "JWT authentication caused CORS issues in production; fixed by adjusting backend headers.",
    "modal_problem_3": "We synchronized local and deployed databases using migration scripts with MySQL Workbench.",
    "modal_stories_title": "User Stories – AprendeShop",
    "modal_story_1": "As a user, I want to buy creative materials to practice what I learn in the courses.",
    "modal_story_2": "As a member, I want to participate in the community forum to exchange tips and feedback with others.",
    "modal_story_3": "As a student, I want to learn at my own pace with flexible access to classes and resources.",
    "modal_roles_title": "Team Roles",
    "modal_role_1": "Frontend Developer – Responsible for UI design and responsive layout using Bootstrap.",
    "modal_role_2": "Backend Developer – Implemented API routes, database models, and authentication with Spring Boot.",
    "modal_role_3": "Project Coordinator – Managed Git branches, documentation, and team communication.",
    "modal_fit_problem_title": "Challenges & Solutions – FitApp",
    "modal_fit_problem_1": "Designing a responsive UI that adapts to both mobile and desktop screens.",
    "modal_fit_problem_2": "Handling user input validation for numeric macro calculations.",
    "modal_fit_problem_3": "Syncing tracker states across multiple components using React hooks.",
    "modal_fit_stories_title": "User Stories – FitApp",
    "modal_fit_story_1": "As a user, I want to track my macros and calories to stay consistent with my diet goals.",
    "modal_fit_story_2": "As a fitness enthusiast, I want to create a shopping list based on my daily meal plan.",
    "modal_fit_story_3": "As a curious learner, I want to stay informed through blog articles about nutrition, supplements, and training.",
    "future_features_btn": "Future Features",
    "modal_fit_future_title": "Upcoming Features & Goals – FitApp",
    "modal_fit_future_1": "Integration with wearable devices such as Apple Watch or Whoop for real-time tracking.",
    "modal_fit_future_2": "Weekly progress charts for calories, macros, and weight evolution.",
    "modal_fit_future_3": "Personalized notifications and reminders for hydration, training, and meal timing.",
    "aprendeshop_subtitle": "Full-stack e-commerce (team project)",
    "aprendeshop_description": "AprendeShop is a full-stack web application developed as part of Generation’s Java Full-Stack Bootcamp.",
    "aprendeshop_tasks_title": "As part of the team, I collaborated on:",
    "aprendeshop_task_1": "Developing responsive UI components with HTML, CSS, JavaScript, and Bootstrap",
    "aprendeshop_task_2": "Building backend functionality with Java and Spring Boot",
    "aprendeshop_task_3": "Implementing RESTful APIs with Spring Boot JPA/Hibernate",
    "aprendeshop_task_4": "Securing authentication and authorization with Spring Security, JWT, and BCrypt",
    "aprendeshop_task_5": "Designing and maintaining relational schemas with MySQL/MariaDB",
    "aprendeshop_task_6": "Deploying the application on AWS",
    "aprendeshop_conclusion": "Although AprendeShop is not a commercial product, it demonstrates my ability to work in agile teams and build scalable solutions.",
    "view_btn": "👁️ View demo",
    "fr_repo_btn": "🎨 Front End Repository",
    "ba_repo_btn": "🧩 Back End Repository",
    "jsdemo_description": "A simple JavaScript demo project: a user search app. <br /> Built with <strong>Vanilla JS, HTML5, and CSS3</strong>. Fetch user data asynchronously from a REST API.",
    "fitapp_description": "Macro Calculator, Food Tracker, Shopping List, Fitness Blog and more..",
    "fitapp_text": "This app is inspired by the bodybuilding lifestyle where nutrition is everything. - I’m currently building this demo.",
    "figma_description": "Wireframe, layout, mockup and prototype",
    "figma_text": "Find my latest UI mockups on Figma — they’re still a work in progress, but constantly evolving with new layouts and design explorations.",
    "portfolio_btn": "Portfolio",
    "SQL_subtitle": "SQL Practices",
    "SQL_description": "This repository contains my SQL practice exercises during the bootcamp. It includes examples of:",
    "SQL_task_1": "Table creation (CREATE TABLE)",
    "SQL_task_2": "Data insertion (INSERT INTO)",
    "SQL_task_3": "Basic queries (SELECT, WHERE, ORDER BY, DISTINCT)",
    "SQL_task_4": "Functions (LIKE, IN, BETWEEN, MONTH(), etc.)",
    "SQL_task_5": "Safe updates and deletes (UPDATE, DELETE)",
    "book": "Illustrator & Photoshop Book",
    "portfolio_PDF_btn": "📔 Book (PDF)",
    "contact_title": "Contact",
    "contact_subtitle": "Let's work together!",
    "contact_email": "Email",
    "footer_rights": "All rights reserved."
}