{
    "hero_title": "Welcome to my portfolio",
    "hero_sub": "Full-Stack Developer & Fashion Designer. UI/UX, performance, and accessibility.",
    "about_title": "About me",
    "about_intro": "Hello! Nice to see you",
    "about_text": "My name is Erika. I studied fashion design, which gave me strong skills in creativity, project management, and attention to detail. Recently, I decided to transition into tech, and now I’m a Java Full-Stack Developer.",
    "skills_title": "Some of my skills:",
    "skills_list": "HTML, CSS, Bootstrap, JavaScript, Java, Spring Boot, React, Tailwind, Adobe Suite, SQL, Git/GitHub...",
    "about_linkedin_intro": "If you want to know more about my professional environment, here’s my LinkedIn profile.",
    "about_linkedin_btn": "LinkedIn",
    "problem_solving_btn": "Problem Solving",
    "user_stories_btn": "User Stories",
    "team_roles_btn": "Team Roles",
    "modal_extra_education_title": "Workshops & Courses",
    "modal_extra_education_intro": "Here are some additional workshops, certifications, and courses that strengthened my skills in both tech and design.",
    "modal_extra_education_tech": "Tech & Development",
    "modal_extra_education_design": "Design & Professional Growth",
    "modal_skills_title": "Technical Skills & Tools",
    "modal_skills_text": "Here are some of the technologies and tools I have experience with:",
    "modal_skills_frontend": "Frontend:",
    "modal_skills_backend": "Backend:",
    "modal_skills_tools": "Tools & Platforms:",
    "modal_education_title": "Education & Training",
    "modal_about_education_intro": "Here’s a glimpse of my academic background and learning path:",
    "modal_about_fullstack": "Java Full Stack Developer Jr - Generation Mexico",
    "modal_about_fullstack_desc": "Generation Mexico – Java Full Stack Bootcamp (2025). Learned end-to-end web development with Spring Boot, Java, MySQL, AWS deployment and more.",
    "modal_about_fullstack_point1": "Back-end architecture with REST APIs",
    "modal_about_fullstack_point2": "JWT authentication & security",
    "modal_about_fullstack_point3": "Responsive UI/UX design with Bootstrap",
    "modal_about_fashiondesign": "Fashion Designer - Colegio Maeyest",
    "modal_about_fashiondesign_desc": "Associate Degree in Fashion Design. Developed a strong eye for detail, aesthetics, proportion, and user-centric creation that now enhances UI/UX work.",
    "modal_about_fashiondesign_point1": "Color theory & composition",
    "modal_about_fashiondesign_point2": "Visual storytelling",
    "modal_about_fashiondesign_point3": "Creative direction & brand coherence",
    "modal_problem_title": "Challenges & Solutions",
    "modal_problem_1": "Configuring AWS Elastic Beanstalk was challenging due to environment variable errors.",
    "modal_problem_2": "JWT authentication caused CORS issues in production; fixed by adjusting backend headers.",
    "modal_problem_3": "We synchronized local and deployed databases using migration scripts with MySQL Workbench.",
    "modal_stories_title": "User Stories – AprendeShop",
    "modal_story_1": "As a user, I want to buy creative materials to practice what I learn in the courses.",
    "modal_story_2": "As a member, I want to participate in the community forum to exchange tips and feedback with others.",
    "modal_story_3": "As a student, I want to learn at my own pace with flexible access to classes and resources.",
    "modal_roles_title": "Team Roles",
    "modal_role_1": "Frontend Developer – Responsible for UI design and responsive layout using Bootstrap.",
    "modal_role_2": "Backend Developer – Implemented API routes, database models, and authentication with Spring Boot.",
    "modal_role_3": "Project Coordinator – Managed Git branches, documentation, and team communication.",
    "modal_fit_problem_title": "Challenges & Solutions – FitApp",
    "modal_fit_problem_1": "Designing a responsive UI that adapts to both mobile and desktop screens.",
    "modal_fit_problem_2": "Handling user input validation for numeric macro calculations.",
    "modal_fit_problem_3": "Syncing tracker states across multiple components using React hooks.",
    "modal_fit_stories_title": "User Stories – FitApp",
    "modal_fit_story_1": "As a user, I want to track my macros and calories to stay consistent with my diet goals.",
    "modal_fit_story_2": "As a fitness enthusiast, I want to create a shopping list based on my daily meal plan.",
    "modal_fit_story_3": "As a curious learner, I want to stay informed through blog articles about nutrition, supplements, and training.",
    "future_features_btn": "Future Features",
    "modal_fit_future_title": "Upcoming Features & Goals – FitApp",
    "modal_fit_future_1": "Integration with wearable devices such as Apple Watch or Whoop for real-time tracking.",
    "modal_fit_future_2": "Weekly progress charts for calories, macros, and weight evolution.",
    "modal_fit_future_3": "Personalized notifications and reminders for hydration, training, and meal timing.",
    "aprendeshop_subtitle": "Full-stack e-commerce (team project)",
    "aprendeshop_description": "AprendeShop is a full-stack web application developed as part of Generation’s Java Full-Stack Bootcamp.",
    "aprendeshop_tasks_title": "As part of the team, I collaborated on:",
    "aprendeshop_task_1": "Developing responsive UI components with HTML, CSS, JavaScript, and Bootstrap",
    "aprendeshop_task_2": "Building backend functionality with Java and Spring Boot",
    "aprendeshop_task_3": "Implementing RESTful APIs with Spring Boot JPA/Hibernate",
    "aprendeshop_task_4": "Securing authentication and authorization with Spring Security, JWT, and BCrypt",
    "aprendeshop_task_5": "Designing and maintaining relational schemas with MySQL/MariaDB",
    "aprendeshop_task_6": "Deploying the application on AWS",
    "aprendeshop_conclusion": "Although AprendeShop is not a commercial product, it demonstrates my ability to work in agile teams and build scalable solutions.",
    "view_btn": "View demo",
    "fr_repo_btn": "Front End Repository",
    "ba_repo_btn": "Back End Repository",
    "jsdemo_description": "A simple JavaScript demo project: a user search app. <br /> Built with <strong>Vanilla JS, HTML5, and CSS3</strong>. Fetch user data asynchronously from a REST API.",
    "fitapp_description": "Macro Calculator, Food Tracker, Shopping List, Fitness Blog and more..",
    "fitapp_text": "This app is inspired by the bodybuilding lifestyle where nutrition is everything. - I’m currently building this demo.",
    "improve_description": "Improvements based on user stories, applying Universal Design principles and user-centered approach to optimize the Birdman site experience. The redesign aims for clearer navigation, visually harmonious and inclusive. I’m currently iterating the project to refine interaction, accessibility, and overall visual coherence.",
    "modal_birdman_stories_title": "User Stories - Birdman Improvements",
    "modal_birdman_story_1": "As a user, I want to easily browse the products and distinguish each protein visually.",
    "modal_birdman_story_2": "As a visitor, I want the color palette and visuals to reflect each bird’s essence, strengthening brand recall.",
    "modal_birdman_story_3": "As a user with different devices, I need an accessible, responsive, and visually coherent interface.",
    "odoo_title": "Odoo Design Excersice",
  "odoo_description": "Web mockup built with Bootstrap, SCSS, and a focus on desktop viewports (≥992px). It was created as part of a technical interview assessment to demonstrate skills in modern layout development, SCSS variable management, project organization best practices and using figma AI.",
  "mapping_title": "Mapping the Shopping Experience",
  "mapping_description": "This case study documents the mapping process behind the redesign of a minimal, modern e-commerce experience. Using Figma, the core elements of the user journey to identify friction points, clarify decision paths, and improve the flow from browsing to checkout.",
  "mapping_task_1": "User Persona",
  "mapping_task_2": "User Journey Map",
  "mapping_task_3": "Service Blueprint",
  "mapping_task_4": "User Journey Map",
  "mapping_task_5": "User Flow",
  "mapping_conclution": "Each section highlights a different layer of the experience from user actions and emotions, to frontstage interactions, backstage processes, and design opportunities. Understanding how users move through an experience and how to redesign a flow with clarity and intention. This structured supports better decisions, clearer navigation, and a more intuitive shopping experience overall.",
 "figma_description": "Wireframe, layout, mockup and prototype",
    "figma_text": "Find my latest UI mockups on Figma — they’re still a work in progress, but constantly evolving with new layouts and design explorations.",
    "portfolio_btn": "Portfolio",
    "SQL_subtitle": "SQL Practices",
    "SQL_description": "This repository contains my SQL practice exercises during the bootcamp. It includes examples of:",
    "SQL_task_1": "Table creation (CREATE TABLE)",
    "SQL_task_2": "Data insertion (INSERT INTO)",
    "SQL_task_3": "Basic queries (SELECT, WHERE, ORDER BY, DISTINCT)",
    "SQL_task_4": "Functions (LIKE, IN, BETWEEN, MONTH(), etc.)",
    "SQL_task_5": "Safe updates and deletes (UPDATE, DELETE)",
    "book": "Illustrator & Photoshop Book",
    "portfolio_PDF_btn": "Book (PDF)",
    "contact_title": "Contact",
    "contact_subtitle": "Let's work together!",
    "contact_email": "Email",
    "footer_rights": "All rights reserved.",

        "aprendeshop_detail_subtitle": "UX Case Study · Educational e-commerce built with Java, Spring Boot and Bootstrap.",
        "back_to_portfolio": "Back to portfolio",
        "project_overview_title": "Project Overview",
        "project_overview_text": "AprendeShop is an e-commerce platform connecting course creators with users interested in creative entrepreneurship. Developed collaboratively during Generation Mexico’s Full Stack Bootcamp, applying agile methodologies, visual design, full stack development and product validation.",
        "ux_process_title": "UX Process",
        "ux_understand_title": "Understand",
        "ux_understand_desc": "User interviews, benchmarking and defining pain points.",
        "ux_ideate_title": "Ideate",
        "ux_ideate_desc": "Brainstorming, user flows and low-fidelity wireframes.",
        "ux_design_title": "Design",
        "ux_design_desc": "Visual design and interactive prototype in Figma.",
        "ux_develop_title": "Develop",
        "ux_develop_desc": "Implementation in Java, Spring Boot and front-end with HTML/CSS/JS.",
        "ux_validate_title": "Validate",
        "ux_validate_desc": "Usability testing and improvements after feedback.",
        "my_role_title": "My role",
        "my_role_text": "Full stack focused on UX/UI and Frontend Development. I worked on information architecture, visual design, component creation and layout structure.",
        "duration_title": "Duration",
        "duration_text": "12 weeks (July — September 2025)",
        "technical_title": "Technical aspects",
        "tech_json": "Dynamic data handling with JSON for rendering courses and categories.",
        "tech_emails": "Automatic email delivery on user registration.",
        "tech_front": "Frontend built with HTML, CSS, and Vanilla JavaScript using Bootstrap.",
        "tech_back": "Backend implemented in Java with Spring Boot and MySQL.",
        "tech_deploy_git": "Deployed via GitHub Pages with version control in Git.",
        "tech_deploy_aws": "Deployed on AWS.",
        "visual_title": "Visual Design",
        "visual_text": "The visual system combines green and burgundy contrast to convey professionalism and clarity, with a flexible layout focused on accessibility and visual hierarchy.",
        "explore_title": "Explore the project",
        "demo_btn": "Demo",
        "repo_btn": "Repository"
      }
