{
    "hero_title": "Bienvenid@ a mi portafolio",
    "hero_sub": "Desarrolladora Full-Stack y Diseñadora de Moda. Diseño UI/UX, rendimiento y accesibilidad.",
    "about_title": "Sobre mí",
    "about_intro": "¡Hola! Qué gusto verte",
    "about_text": "Me llamo Erika. Estudié diseño de moda, lo que me dio habilidades sólidas en creatividad, gestión de proyectos y atención al detalle. Recientemente decidí transicionar al mundo tech, y ahora soy Desarrolladora Full-Stack Java.",
    "skills_title": "Algunas de mis habilidades:",
    "skills_list": "HTML, CSS, Bootstrap, JavaScript, Java, Spring Boot, React, Tailwind, Adobe Suite, SQL, Git/GitHub...",
    "about_linkedin_intro": "Si quieres conocer más sobre mi entorno profesional, aquí está mi perfil de LinkedIn.",
    "about_linkedin_btn": "LinkedIn",
    "problem_solving_btn": "Resolución de Problemas",
    "user_stories_btn": "Historias de Usuario",
    "team_roles_btn": "Roles del Equipo",
    "modal_extra_education_title": "Talleres & cursos",
    "modal_extra_education_intro": "Algunos de los talleres, cursos y cerificaciones que me impulsan a fortalecer mis habilidades técnicas y creativas.",
    "modal_extra_education_tech": "Tech & Desarrollo",
    "modal_extra_education_design": "Diseño y desarrollo personal",
    "modal_skills_title": "Habilidades Técnicas y Herramientas",
    "modal_skills_text": "Aquí algunas de las tecnologías y herramientas con las que tengo experiencia:",
    "modal_skills_frontend": "Frontend:",
    "modal_skills_backend": "Backend:",
    "modal_skills_tools": "Herramientas y Plataformas:",
    "modal_education_title": "Educación y Formación",
    "modal_about_education_intro": "Una breve mirada a mi formación académica y trayectoria de aprendizaje:",
    "modal_about_fullstack": "Desarrolladora Java Full Stack Jr - Generation México",
    "modal_about_fullstack_desc": "Generation México – Bootcamp Java Full Stack (2025). Aprendí desarrollo web de principio a fin con Spring Boot, Java, MySQL, despliegue en AWS y más.",
    "modal_about_fullstack_point1": "Arquitectura backend con APIs REST",
    "modal_about_fullstack_point2": "Autenticación y seguridad con JWT",
    "modal_about_fullstack_point3": "Diseño UI/UX responsivo con Bootstrap",
    "modal_about_fashiondesign": "Diseñadora de Moda - Colegio Maeyest",
    "modal_about_fashiondesign_desc": "Técnico en Diseño de Moda. Desarrollé sensibilidad por la estética, proporción y creación centrada en el usuario que hoy potencian mi trabajo UI/UX.",
    "modal_about_fashiondesign_point1": "Teoría del color y composición",
    "modal_about_fashiondesign_point2": "Narrativa visual",
    "modal_about_fashiondesign_point3": "Dirección creativa y coherencia de marca",
    "modal_problem_title": "Retos y Soluciones",
    "modal_problem_1": "Configurar AWS Elastic Beanstalk fue un reto por errores en las variables de entorno.",
    "modal_problem_2": "La autenticación con JWT causó problemas de CORS en producción, solucionados ajustando los encabezados del backend.",
    "modal_problem_3": "Sincronizamos las bases de datos locales y desplegadas mediante scripts de migración en MySQL Workbench.",
    "modal_stories_title": "Historias de Usuario – AprendeShop",
    "modal_story_1": "Como usuario, quiero comprar materiales creativos para practicar lo que aprendo en los cursos.",
    "modal_story_2": "Como miembro, quiero participar en el foro comunitario para compartir consejos e intercambiar opiniones.",
    "modal_story_3": "Como estudiante, quiero aprender a mi propio ritmo con acceso flexible a clases y recursos.",
    "modal_roles_title": "Roles del Equipo",
    "modal_role_1": "Frontend Developer – Responsable del diseño de la interfaz y maquetado responsivo con Bootstrap.",
    "modal_role_2": "Backend Developer – Implementación de rutas API, modelos de base de datos y autenticación con Spring Boot.",
    "modal_role_3": "Coordinadora de Proyecto – Encargada de la gestión de ramas Git, documentación y comunicación del equipo.",
    "modal_fit_problem_title": "Retos y Soluciones – FitApp",
    "modal_fit_problem_1": "Diseñar una interfaz responsiva adaptable tanto a móvil como escritorio.",
    "modal_fit_problem_2": "Gestionar la validación de datos numéricos en el cálculo de macros del usuario.",
    "modal_fit_problem_3": "Sincronizar los estados de los trackers entre múltiples componentes usando hooks de React.",
    "modal_fit_stories_title": "Historias de Usuario – FitApp",
    "modal_fit_story_1": "Como usuario, quiero registrar mis macros y calorías para mantenerme constante con mis metas de dieta.",
    "modal_fit_story_2": "Como amante del fitness, quiero generar una lista de supermercado basada en mi plan de comidas diario.",
    "modal_fit_story_3": "Como persona interesada en salud, quiero mantenerme informada a través del blog sobre nutrición, suplementos y entrenamiento.",
    "future_features_btn": "Próximas Funcionalidades",
    "modal_fit_future_title": "Próximas Funcionalidades y Objetivos – FitApp",
    "modal_fit_future_1": "Integración con dispositivos wearables como Apple Watch o Whoop para seguimiento en tiempo real.",
    "modal_fit_future_2": "Gráficas semanales de progreso en calorías, macros y evolución del peso.",
    "modal_fit_future_3": "Notificaciones personalizadas y recordatorios para hidratación, entrenamiento y horarios de comida.",
    "aprendeshop_subtitle": "E-commerce full-stack (proyecto en equipo)",
    "aprendeshop_description": "AprendeShop es una aplicación web full-stack desarrollada durante el bootcamp de Generation Java Full-Stack.",
    "aprendeshop_tasks_title": "Como parte del equipo, colaboré en:",
    "aprendeshop_task_1": "Desarrollo de componentes UI responsivos con HTML, CSS, JavaScript y Bootstrap",
    "aprendeshop_task_2": "Implementación del backend con Java y Spring Boot",
    "aprendeshop_task_3": "Creación de APIs RESTful con Spring Boot JPA/Hibernate",
    "aprendeshop_task_4": "Autenticación y autorización con Spring Security, JWT y BCrypt",
    "aprendeshop_task_5": "Diseño y mantenimiento del esquema relacional con MySQL/MariaDB",
    "aprendeshop_task_6": "Despliegue de la aplicación en AWS",
    "aprendeshop_conclusion": "Aunque AprendeShop no es un producto comercial, demuestra mi capacidad de trabajar en equipos ágiles y crear soluciones escalables.",
    "view_btn": "Ver demo",
    "fr_repo_btn": "Repositorio Front End",
    "ba_repo_btn": "Repositorio Back End",
    "jsdemo_description": "Un proyecto simple en JavaScript: una app para buscar usuarios. <br /> Desarrollado con <strong>Vanilla JS, HTML5 y CSS3</strong>. Obtiene datos de usuario de una API REST de forma asíncrona.",
    "fitapp_description": "Calculadora de macros, Rastreador de alimentos, Lista de compras, Blog wellness y más..",
    "fitapp_text": "Esta app está inspirada en el estilo de vida bodybuilding y wellness donde la nutrición lo es todo. - Actualmente sigo trabajando este demo.",
    "improve_description": "Mejoras basadas en historias de usuario, aplicando principios de Diseño Universal y enfoque centrado en el usuario para optimizar la experiencia del sitio Birdman. El rediseño busca una navegación más clara, visualmente armónica e inclusiva. Actualmente sigo iterando el proyecto para refinar la interacción, accesibilidad y coherencia visual general.",
    "modal_birdman_stories_title": "Historias de usuario - Birdman Improvements",
    "modal_birdman_story_1": "Como usuario quiero navegar fácilmente entre los productos para identificar las proteínas sin confusión visual.",
    "modal_birdman_story_2": "Como visitante deseo que el diseño y los colores transmitan la esencia de cada ave, mejorando la recordación de marca.",
    "modal_birdman_story_3": "Como usuario con diferentes dispositivos necesito una interfaz accesible, responsiva y coherente visualmente.",
    "odoo_description": "Mockup web construido con Bootstrap 4.6, SCSS y enfoque en viewports de escritorio (≥992px). Fue creado como parte de una evaluación técnica para demostrar habilidades en desarrollo de maquetado moderno, gestión de variables SCSS y mejores prácticas de organización de proyectos.",
    "figma_description": "Wireframe, layout, mockup y prototipado",
    "figma_text": "Encuentra mis últimos mockups UI en Figma — aún están en proceso, procuro evolución constante con nuevos layouts y exploración de diseño.",
    "portfolio_btn": "Portafolio",
    "SQL_subtitle": "Prácticas en SQL",
    "SQL_description": "Este repositorio contiene ejercicios de práctica en SQL durante el bootcamp. Incluye ejemplos de:",
    "SQL_task_1": "Creación de tablas (CREATE TABLE)",
    "SQL_task_2": "Inserción de datos (INSERT INTO)",
    "SQL_task_3": "Consultas básicas (SELECT, WHERE, ORDER BY, DISTINCT)",
    "SQL_task_4": "Funciones (LIKE, IN, BETWEEN, MONTH(), etc.)",
    "SQL_task_5": "Actualizaciones y eliminaciones seguras (UPDATE, DELETE)",
    "book": "Portafolio Illustrator & Photoshop",
    "portfolio_PDF_btn": "Portafolio (PDF)",
    "contact_title": "Contacto",
    "contact_subtitle": "¡Colaboremos!",
    "contact_email": "Correo",
    "footer_rights": "Todos los derechos reservados.",

        "aprendeshop_detail_subtitle": "UX Case Study · E-commerce educativo desarrollado con Java, Spring Boot y Bootstrap.",
        "back_to_portfolio": "Volver al portafolio",
        "project_overview_title": "Resumen del proyecto",
        "project_overview_text": "AprendeShop es una plataforma e-commerce enfocada en conectar a creadores de cursos con usuarios interesados en aprender sobre emprendimiento creativo. El proyecto se desarrolló en equipo dentro del Bootcamp de Generation México, aplicando metodologías ágiles, diseño visual, desarrollo full stack y validación de producto.",
        "ux_process_title": "Proceso UX",
        "ux_understand_title": "Understand",
        "ux_understand_desc": "Entrevistas, benchmarking y definición de pain points.",
        "ux_ideate_title": "Ideate",
        "ux_ideate_desc": "Brainstorming, flujos de usuario y wireframes de baja fidelidad.",
        "ux_design_title": "Design",
        "ux_design_desc": "Diseño visual y prototipo interactivo en Figma.",
        "ux_develop_title": "Develop",
        "ux_develop_desc": "Implementación en Java, Spring Boot y front con HTML/CSS/JS.",
        "ux_validate_title": "Validate",
        "ux_validate_desc": "Pruebas de usabilidad y ajustes finales tras retroalimentación.",
        "my_role_title": "Mi rol",
        "my_role_text": "Full stack enfocada en UX/UI y Frontend Developer. Participé en la arquitectura de información, diseño visual, creación de componentes y maquetación de vistas principales.",
        "duration_title": "Duración",
        "duration_text": "12 semanas (Julio — Septiembre 2025)",
        "technical_title": "Aspectos técnicos",
        "tech_json": "Gestión dinámica de datos con JSON para renderizar cursos y categorías.",
        "tech_emails": "Implementación de envío de correos automáticos al registrarse.",
        "tech_front": "Frontend desarrollado en HTML, CSS y JavaScript Vanilla con Bootstrap.",
        "tech_back": "Backend implementado en Java con Spring Boot y MySQL.",
        "tech_deploy_git": "Despliegue en GitHub Pages con control de versiones en Git.",
        "tech_deploy_aws": "Despliegue en AWS.",
        "visual_title": "Diseño visual",
        "visual_text": "El sistema visual combina contraste entre verde y guinda para transmitir profesionalismo y claridad, con un layout flexible centrado en accesibilidad y jerarquía visual.",
        "explore_title": "Explora el proyecto",
        "demo_btn": "Demo",
        "repo_btn": "Repositorio"
}