{
    "hero_title": "Bienvenid@ a mi portafolio",
    "hero_sub": "Desarrolladora Full-Stack y Diseñadora de Moda. Diseño UI/UX, rendimiento y accesibilidad.",
    "about_title": "Sobre mí",
    "about_intro": "¡Hola! Qué gusto verte",
    "about_text": "Me llamo Erika. Estudié diseño de moda, lo que me dio habilidades sólidas en creatividad, gestión de proyectos y atención al detalle. Recientemente decidí transicionar al mundo tech, y ahora soy Desarrolladora Full-Stack Java.",
    "skills_title": "Algunas de mis habilidades:",
    "skills_list": "HTML, CSS, Bootstrap, JavaScript, Java, Spring Boot, React, Tailwind, Adobe Suite, SQL, Git/GitHub...",
    "about_linkedin_intro": "Si quieres conocer más sobre mi entorno profesional, aquí está mi perfil de LinkedIn.",
    "about_linkedin_btn": "LinkedIn",
    "problem_solving_btn": "Resolución de Problemas",
    "user_stories_btn": "Historias de Usuario",
    "team_roles_btn": "Roles del Equipo",
    "modal_extra_education_title": "Talleres & cursos",
    "modal_extra_education_intro": "Algunos de los talleres, cursos y cerificaciones que me impulsan a fortalecer mis habilidades técnicas y creativas.",
    "modal_extra_education_tech": "Tech & Desarrollo",
    "modal_extra_education_design": "Diseño y desarrollo personal",
    "modal_skills_title": "Habilidades Técnicas y Herramientas",
    "modal_skills_text": "Aquí algunas de las tecnologías y herramientas con las que tengo experiencia:",
    "modal_skills_frontend": "Frontend:",
    "modal_skills_backend": "Backend:",
    "modal_skills_tools": "Herramientas y Plataformas:",
    "modal_education_title": "Educación y Formación",
    "modal_about_education_intro": "Una breve mirada a mi formación académica y trayectoria de aprendizaje:",
    "modal_about_fullstack": "Desarrolladora Java Full Stack Jr - Generation México",
    "modal_about_fullstack_desc": "Generation México – Bootcamp Java Full Stack (2025). Aprendí desarrollo web de principio a fin con Spring Boot, Java, MySQL, despliegue en AWS y más.",
    "modal_about_fullstack_point1": "Arquitectura backend con APIs REST",
    "modal_about_fullstack_point2": "Autenticación y seguridad con JWT",
    "modal_about_fullstack_point3": "Diseño UI/UX responsivo con Bootstrap",
    "modal_about_fashiondesign": "Diseñadora de Moda - Colegio Maeyest",
    "modal_about_fashiondesign_desc": "Técnico en Diseño de Moda. Desarrollé sensibilidad por la estética, proporción y creación centrada en el usuario que hoy potencian mi trabajo UI/UX.",
    "modal_about_fashiondesign_point1": "Teoría del color y composición",
    "modal_about_fashiondesign_point2": "Narrativa visual",
    "modal_about_fashiondesign_point3": "Dirección creativa y coherencia de marca",
    "modal_problem_title": "Retos y Soluciones",
    "modal_problem_1": "Configurar AWS Elastic Beanstalk fue un reto por errores en las variables de entorno.",
    "modal_problem_2": "La autenticación con JWT causó problemas de CORS en producción, solucionados ajustando los encabezados del backend.",
    "modal_problem_3": "Sincronizamos las bases de datos locales y desplegadas mediante scripts de migración en MySQL Workbench.",
    "modal_stories_title": "Historias de Usuario – AprendeShop",
    "modal_story_1": "Como usuario, quiero comprar materiales creativos para practicar lo que aprendo en los cursos.",
    "modal_story_2": "Como miembro, quiero participar en el foro comunitario para compartir consejos e intercambiar opiniones.",
    "modal_story_3": "Como estudiante, quiero aprender a mi propio ritmo con acceso flexible a clases y recursos.",
    "modal_roles_title": "Roles del Equipo",
    "modal_role_1": "Frontend Developer – Responsable del diseño de la interfaz y maquetado responsivo con Bootstrap.",
    "modal_role_2": "Backend Developer – Implementación de rutas API, modelos de base de datos y autenticación con Spring Boot.",
    "modal_role_3": "Coordinadora de Proyecto – Encargada de la gestión de ramas Git, documentación y comunicación del equipo.",
    "modal_fit_problem_title": "Retos y Soluciones – FitApp",
    "modal_fit_problem_1": "Diseñar una interfaz responsiva adaptable tanto a móvil como escritorio.",
    "modal_fit_problem_2": "Gestionar la validación de datos numéricos en el cálculo de macros del usuario.",
    "modal_fit_problem_3": "Sincronizar los estados de los trackers entre múltiples componentes usando hooks de React.",
    "modal_fit_stories_title": "Historias de Usuario – FitApp",
    "modal_fit_story_1": "Como usuario, quiero registrar mis macros y calorías para mantenerme constante con mis metas de dieta.",
    "modal_fit_story_2": "Como amante del fitness, quiero generar una lista de supermercado basada en mi plan de comidas diario.",
    "modal_fit_story_3": "Como persona interesada en salud, quiero mantenerme informada a través del blog sobre nutrición, suplementos y entrenamiento.",
    "future_features_btn": "Próximas Funcionalidades",
    "modal_fit_future_title": "Próximas Funcionalidades y Objetivos – FitApp",
    "modal_fit_future_1": "Integración con dispositivos wearables como Apple Watch o Whoop para seguimiento en tiempo real.",
    "modal_fit_future_2": "Gráficas semanales de progreso en calorías, macros y evolución del peso.",
    "modal_fit_future_3": "Notificaciones personalizadas y recordatorios para hidratación, entrenamiento y horarios de comida.",
    "aprendeshop_subtitle": "E-commerce full-stack (proyecto en equipo 9 semanas)",
    "aprendeshop_description": "AprendeShop es una aplicación web full-stack desarrollada durante el bootcamp de Generation Java Full-Stack.",
    "aprendeshop_tasks_title": "Como parte del equipo, colaboré en:",
    "aprendeshop_task_1": "Desarrollo de componentes UI responsivos con HTML, CSS, JavaScript y Bootstrap",
    "aprendeshop_task_2": "Implementación del backend con Java y Spring Boot",
    "aprendeshop_task_3": "Creación de APIs RESTful con Spring Boot JPA/Hibernate",
    "aprendeshop_task_4": "Autenticación y autorización con Spring Security, JWT y BCrypt",
    "aprendeshop_task_5": "Diseño y mantenimiento del esquema relacional con MySQL/MariaDB",
    "aprendeshop_task_6": "Despliegue de la aplicación en AWS",
    "aprendeshop_conclusion": "Aunque AprendeShop no es un producto comercial, demuestra mi capacidad de trabajar en equipos ágiles y crear soluciones escalables.",
    "view_btn": "Ver demo",
    "fr_repo_btn": "Repositorio Front End",
    "ba_repo_btn": "Repositorio Back End",
    "jsdemo_description": "Un proyecto simple en JavaScript: una app para buscar usuarios. <br /> Desarrollado con <strong>Vanilla JS, HTML5 y CSS3</strong>. Obtiene datos de usuario de una API REST de forma asíncrona.",
    "fitapp_description": "Calculadora de macros, Rastreador de alimentos, Lista de compras, Blog wellness y más..",
    "fitapp_text": "Esta app está inspirada en el estilo de vida bodybuilding y wellness donde la nutrición lo es todo. - Actualmente sigo trabajando este demo.",
    "improve_description": "Mejoras basadas en historias de usuario, aplicando principios de Diseño Universal y enfoque centrado en el usuario para optimizar la experiencia del sitio Birdman. El rediseño busca una navegación más clara, visualmente armónica e inclusiva. Actualmente sigo iterando el proyecto para refinar la interacción, accesibilidad y coherencia visual general.",
    "modal_birdman_stories_title": "Historias de usuario - Birdman Improvements",
    "modal_birdman_story_1": "Como usuario quiero navegar fácilmente entre los productos para identificar las proteínas sin confusión visual.",
    "modal_birdman_story_2": "Como visitante deseo que el diseño y los colores transmitan la esencia de cada ave, mejorando la recordación de marca.",
    "modal_birdman_story_3": "Como usuario con diferentes dispositivos necesito una interfaz accesible, responsiva y coherente visualmente.",
    "odoo_title": "Odoo Ejercicio de Diseño",
    "odoo_description": "Mockup web construido con Bootstrap, SCSS y enfoque en viewports de escritorio (≥992px). Fue creado como parte de una evaluación técnica para demostrar habilidades en desarrollo de maquetado moderno, gestión de variables SCSS, mejores prácticas de organización de proyectos y uso de IA de figma.",
    "google_description": "Google UX Design Professional Certificate (en curso)",
  "google_text": "Este certificado me permite trabajar con procesos UX completos: investigación, definición del problema, ideación, wireframes, prototipado, pruebas con usuarios y diseño UI avanzado, integrando Figma, accesibilidad y buenas prácticas de diseño.",
  "google_courses": [
    "Foundations of User Experience (UX) Design",
    "Start the UX Process: Empathize, Define, Ideate",
    "Empathize, Define, Ideate: User, Empathy map, Persona, User Journey, Statements, Flows, Storyboard, Sitemaps, IA..",
    "Build Wireframes and Low-Fidelity Prototypes",
    "Conduct UX Research and Test Early Concepts",
    "Create High-Fidelity Designs and Prototypes in Figma",
    "Build Dynamic User Interface (UI) for Websites",
    "Design a User Experience for Social Good & Prepare for Jobs"
  ],
    "mapping_title": "Mapeo de la Experiencia de Compra",
    "mapping_description": "Este caso de estudio documenta el proceso de mapeo detrás del rediseño de una experiencia de e-commerce minimalista y moderna. Usando Figma, los elementos centrales del recorrido del usuario para identificar fricciones, clarificar decisiones y mejorar el flujo desde la navegación hasta el checkout.",
    "mapping_task_1": "Persona de Usuario",
    "mapping_task_2": "Mapa del Recorrido del Usuario",
    "mapping_task_3": "Diagrama de Servicio",
    "mapping_task_4": "Mapa del Recorrido del Usuario",
    "mapping_task_5": "Flujo de Usuario",
    "mapping_conclution": "Cada sección muestra una capa diferente de la experiencia: acciones y emociones del usuario, interacciones frontstage, procesos internos (backstage) y oportunidades de diseño. Entender cómo se mueve el usuario y cómo rediseñar el flujo con claridad e intención. Permite mejores decisiones, navegación más clara y una experiencia de compra más intuitiva.",
    "figma_description": "Wireframe, layout, mockup y prototipado",
    "figma_text": "Encuentra mis últimos mockups UI en Figma — aún están en proceso, procuro evolución constante con nuevos layouts y exploración de diseño.",
    "portfolio_btn": "Portafolio",
    "SQL_subtitle": "Prácticas en SQL",
    "SQL_description": "Este repositorio contiene ejercicios de práctica en SQL durante el bootcamp. Incluye ejemplos de:",
    "SQL_task_1": "Creación de tablas (CREATE TABLE)",
    "SQL_task_2": "Inserción de datos (INSERT INTO)",
    "SQL_task_3": "Consultas básicas (SELECT, WHERE, ORDER BY, DISTINCT)",
    "SQL_task_4": "Funciones (LIKE, IN, BETWEEN, MONTH(), etc.)",
    "SQL_task_5": "Actualizaciones y eliminaciones seguras (UPDATE, DELETE)",
    "book": "Portafolio Illustrator & Photoshop",
    "portfolio_PDF_btn": "Portafolio (PDF)",
    "contact_title": "Contacto",
    "contact_subtitle": "¡Colaboremos!",
    "contact_email": "Correo",
    "footer_rights": "Todos los derechos reservados.",
    "aprendeshop_detail_subtitle": "Web full stack · E-commerce educativo desarrollado con Java, Spring Boot y Bootstrap.",
    "back_to_portfolio": "Volver al portafolio",
    "project_overview_text": "AprendeShop es un proyecto académico full stack (no es un caso real de cliente, pero está diseñado como si lo fuera). Es una plataforma educativa de comercio electrónico desarrollada por un equipo multidisciplinario bajo la metodología ágil Scrum. El objetivo fue diseñar y construir un MVP funcional que simula un escenario real de cliente con autenticación de usuarios, exploración de cursos, gestión de listas de deseos y participación en un foro comunitario, aplicando diseño centrado en el usuario. Trabajamos en sprints semanales que incluyeron planificación, revisiones y retrospectivas.",
    "technologies_title": "Tecnologías utilizadas",
    "technologies_list": "Frontend: HTML, CSS y JavaScript con Bootstrap 5.3.7. Backend: Java, Spring Boot y MySQL. Herramientas adicionales: Figma (diseño UX/UI), Trello, GitHub (control de versiones), AWS (despliegue) y JSON (manejo dinámico de datos).",
    "features_title": "Funciones principales",
    "features_list": "Registro de usuarios y autenticación basada en roles con JSON Web Token. Lista de deseos para cursos. Foro de discusión para interacción comunitaria. Renderizado dinámico de cursos y categorías mediante JSON. Desplegado con GitHub Pages y AWS.",
    "based_on_title": "Basado en",
    "based_on_text": "Este proyecto fue desarrollado como parte del Bootcamp Full-Stack Java de Generation México, combinando accesibilidad educativa con funcionalidad de comercio electrónico en un entorno colaborativo real. Cada sprint se enfocó en entregar incrementos utilizables, desde el modelado de base de datos hasta la validación de interfaces, garantizando que las decisiones de diseño y desarrollo se alinearan con las necesidades del usuario y los objetivos del negocio.",
    "ux_process_title": "Proceso UX / Design Sprint",
    "ux_empathize_title": "Empatizar",
    "ux_empathize_desc": "Estudiar el mercado, analizar competidores y comprender las necesidades del negocio y del cliente para definir metas y parámetros.",
    "ux_define_title": "Definir",
    "ux_define_desc": "Aclarar el problema principal — acceso opcional a los materiales de cada curso y garantizar la orientación del usuario a través del foro comunitario.",
    "ux_ideate_title": "Idear",
    "ux_ideate_desc": "Trabajo colaborativo — lluvia de ideas, revisión empática y toma de decisiones para generar soluciones centradas en el usuario.",
    "ux_prototype_title": "Prototipar",
    "ux_prototype_desc": "Construir un prototipo de alta fidelidad en Figma que visualice la experiencia del usuario y el flujo de interacción.",
    "ux_test_title": "Probar",
    "ux_test_desc": "Validar con pruebas de usabilidad y revisiones técnicas mediante Postman y MySQL, iterando según la retroalimentación.",
    "my_role_title": "Mi rol",
    "my_role_text": "Desarrolladora Full-Stack. Mi enfoque principal fue el diseño UX/UI, la estructura del frontend y mantener la coherencia visual en el sistema de diseño para garantizar una experiencia de usuario intuitiva, estética y responsiva. Colaboré estrechamente con la integración del backend utilizando ramas de Git y Pull Requests para la coordinación del equipo.",
    "duration_title": "Duración",
    "duration_text": "9 semanas (julio — septiembre 2025)",
    "technical_title": "Aspectos técnicos",
    "tech_json": "Manejo dinámico de datos con JSON para renderizar cursos y categorías.",
    "tech_emails": "Envío automático de correo al equipo desde el formulario de contacto mediante EmailJS.",
    "tech_front": "Frontend desarrollado con HTML, CSS y JavaScript usando Bootstrap 5.3.7.",
    "tech_back": "Backend implementado en Java 21 con Spring Boot Gradle, JPA/Hibernate y conexión con base de datos MySQL.",
    "tech_test": "Implementación de Postman con métodos GET, POST, PUT y DELETE, además de pruebas con JUnit5.",
    "tech_deploy_git": "Desplegado mediante GitHub Pages con control de versiones en Git.",
    "tech_deploy_aws": "Desplegado en AWS usando MariaDB.",
    "problem_solving_title": "Resolución de problemas y aprendizajes",
    "problem_solving_text": "Integré un sistema de diseño coherente entre frontend y backend. Estructuré la lógica de renderizado dinámico reutilizable con JSON. Mejoré la productividad aplicando ceremonias Scrum y gestión de tareas con Trello. Logré equilibrar el diseño visual con la escalabilidad técnica, asegurando mantenibilidad y compatibilidad entre navegadores.",
    "explore_title": "Explorar proyecto",
    "demo_btn": "Demo",
    "repo_btn": "Repositorio"
}